In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = pd.read_csv("../data/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df["Age"].value_counts().sort_values(ascending=False)

Age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [14]:
fare = df.loc[:, ['Age','Fare']]
fare.sort_values(by='Fare', ascending=False)

      Age      Fare
258  35.0  512.3292
737  35.0  512.3292
679  36.0  512.3292
88   23.0  263.0000
27   19.0  263.0000
..    ...       ...
633   NaN    0.0000
413   NaN    0.0000
822  38.0    0.0000
732   NaN    0.0000
674   NaN    0.0000

[891 rows x 2 columns]

In [17]:
df['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [19]:
df['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [25]:
df.loc[: , ['Pclass', 'Survived']].value_counts()

Pclass  Survived
3       0           372
1       1           136
3       1           119
2       0            97
        1            87
1       0            80
Name: count, dtype: int64

In [29]:
df.loc[: , ['Age', 'Survived']].corr()

               Age  Survived
Age       1.000000 -0.077221
Survived -0.077221  1.000000

In [31]:
df.loc[: , ['Sex', 'Survived']].corr()

ValueError: could not convert string to float: 'male'